           03 TRANSACTION-HISTORY.
            05 TR-TRANS-ITEM OCCURS 10 TIMES.
               07 TR-TRANS-ID          PIC X(15).
               07 TR-TRANS-DATE        PIC X(10).
               07 TR-TRANS-REF         PIC X(20).
               07 TR-TRANS-AMOUNT      PIC X(11).
               07 TR-TRANS-TYPE        PIC X(2).
               07 TR-BALANCE           PIC X(11).
