       IDENTIFICATION DIVISION.                              
       PROGRAM-ID. HELLOW2.                                    
       ENVIRONMENT DIVISION.                                 
       DATA DIVISION.                                        
       PROCEDURE DIVISION.                                   
           DISPLAY 'HELLO WORLD'.                            
           DISPLAY 'THIS IS GOMATHIs POPUP TEST PROGRAM'.    
           STOP RUN.                                         